# -*- coding: utf-8 -*-
# 股票-行业映射表
# 自动生成于: 2025-12-29 11:44:15

STOCK_INDUSTRY_MAPPING = {
    "SH600000": {'SW2021_L1_name': '银行', 'SW2021_L1_code': '210000'},
    "SH600036": {'SW2021_L1_name': '银行', 'SW2021_L1_code': '210000'},
    "SH601166": {'SW2021_L1_name': '银行', 'SW2021_L1_code': '210000'},
    "SH601398": {'SW2021_L1_name': '银行', 'SW2021_L1_code': '210000'},
    "SH601939": {'SW2021_L1_name': '银行', 'SW2021_L1_code': '210000'},
    "SH601988": {'SW2021_L1_name': '银行', 'SW2021_L1_code': '210000'},
    "SH002142": {'SW2021_L1_name': '银行', 'SW2021_L1_code': '210000'},
    "SH600519": {'SW2021_L1_name': '食品饮料', 'SW2021_L1_code': '220000'},
    "SH000858": {'SW2021_L1_name': '食品饮料', 'SW2021_L1_code': '220000'},
    "SH600276": {'SW2021_L1_name': '医药生物', 'SW2021_L1_code': '230000'},
    "SZ000661": {'SW2021_L1_name': '医药生物', 'SW2021_L1_code': '230000'},
    "SZ000002": {'SW2021_L1_name': '房地产', 'SW2021_L1_code': '240000'},
    "SH600048": {'SW2021_L1_name': '房地产', 'SW2021_L1_code': '240000'},
    "SH600104": {'SW2021_L1_name': '汽车', 'SW2021_L1_code': '250000'},
    "SZ000625": {'SW2021_L1_name': '汽车', 'SW2021_L1_code': '250000'},
}
